import sys
sys.stdin = open("input.txt",'r')
n, m = map(int,input().split())
board = [[int(x) for x in input().split()] for _ in range(n)]
# 정사각형은 서로 겹치면 안 된다.
# 도형은 모두 연결되어 있어야 한다.
# 정사각형의 변끼리 연결되어 있어야 한다. 
# 즉, 꼭짓점과 꼭짓점만 맞닿아 있으면 안 된다.
pieces = [
    [[0,0],[0,1],[0,2],[0,3]], # 파랑이 : 1자
    [[0,0],[1,0],[2,0],[3,0]], # 파랑이 :세로 
    [[0,0],[1,0],[2,0],[2,1]], # 주황색: ㄴ 자
    [[0,0],[1,0],[2,0],[2,-1]], # 주황색: 긴 ㄴ 반대자
    [[0,0],[0,1],[1,0],[2,0]], # 주황색: 긴 ㄱ 반대자
    [[0,0],[0,1],[1,1],[2,1]], # 주황색: 긴 ㄱ 자
    [[0,0],[0,1],[0,2],[-1,2]], # 주황색: 찌부러진 ㄴ 반대
    [[0,0],[1,0],[1,1],[1,2]], # 주황색: 찌부러진 ㄴ 
    [[0,0],[0,1],[0,2],[1,2]], # 주황색: 찌부 ㄱ 자
    [[0,0],[1,0],[0,1],[0,2]], # 주황색 찌부 ㄱ반대
    [[0,0],[0,1],[1,0],[1,1]], # 네모 노랑이
    [[0,1],[1,0],[1,1],[2,0]],
    [[0,1],[0,2],[1,1],[1,0]],
    [[0,0],[0,1],[1,1],[1,2]],
    [[0,0],[1,0],[1,1],[2,1]],
    [[1,0],[0,1],[1,1],[1,2]],
    [[0,0],[1,0],[1,1],[2,0]],
    [[1,0],[0,1],[1,1],[2,1]],
    [[0,0],[0,1],[0,2],[1,1]]]

def find(dx,dy):

    p_sum = 0
    for k in range(4):
        dx, dy = pieces[p][k]
        try:
            p_sum += board[i+dx][j+dy]
        except IndexError:
            p_sum = 0
            break
    return p_sum

ans = 0
for i in range(n):
    for j in range(m):
        for p in range(len(pieces)):
            p_sum = find(pieces[p][0],pieces[p][1])

            if ans < p_sum:
                ans = p_sum

print(ans)